package Chapter7;

public class Extends {
    /*
    Наследуемый класс называют - супер-классом, наследующий - подклассом.
    Подкласс является специализированной версией суперкласса,
    которая наследует все переменные и методы суперкласса

    Форма объявления класса, который наследует супер-класс:
    class имя_подкласса extends имя_суперкласса{
    тело класса
    }

    Для каждого создаваемого подкласса можно указать лишь 1 супер-класс
    При этом допускается многоуровневая иерархия, в которой один подкласс
    является суперклассом другого подкласса.

    класс не МБ суперклассом по отношению к самому себе.

    Для вызова конструктора суперкласса из подкласса используется след синтаксис ключевого слова super:
    super(список_параметров);
    Список парамертов определяет параметры, которые использует конструктор супер класса. super() всегда
    должен быть первой инструкцией в теле конструктора подкласса.













     */
}
