package Chapter8;

public class CH8 {
    /*
Инструкция import:
import имя_пакета.имя_класса;
Если нужно импортировать все содержимое пакета, вместе имени класса следует указать
звездочку (*). Ниже приведены примеры обеих форм записи инструкции import:
1. import mypack.Myclass;
2. import mypack.*;
В первом случае импортируется лишь класс Myclass.
Во втором - все классы из данного пакета.

Интерфейсы 324
В абстрактном методе - сигнатура(имя метода + параметр'ы)

В интерфейсе ни в одном из методов не должно быть тела
Один интерфейс - множество методов


     */
}

