package Chapter8;

public class CH8 {
    /*
Инструкция import:
import имя_пакета.имя_класса;
Если нужно импортировать все содержимое пакета, вместе имени класса следует указать
звездочку (*). Ниже приведены примеры обеих форм записи инструкции import:
1. import mypack.Myclass;
2. import mypack.*;
В первом случае импортируется лишь класс Myclass.
Во втором - все классы из данного пакета.

Интерфейсы объявляются с помощью ключевого слова - interface.
Упрощенная форма объявления интерфейса:

доступ interface имя {
возвращаемый_тип имя_метода_1(список_параметров);

Возвращаемый_тип имя_метода_2(список_параметров);
тип переменная_1 = значение;
тип переменная_2 = значение;

возвращаемый_тип имя_метода_N(список параметров);
тип переменная_N = значение;
}
Для реализации интерфейса в объявление класса нужно ввести ключевое слово - implements
     */
}
