package Chapter8;

public class interface1 {
    /*\
    Форма объявления интерфейса:

    доступ interface_имя{
    возвращаемый_тип имя_метода_1(список_параметров);
    Возвращаемый_тип имя_метода_2(список_параметров);

    тип переменная_1 = значение;
    тип переменная_2 = значение;

    //....

    возвращаемый_тип имя_метода_N(список_параметров);
    тип переменная_N  = значение;

    Доступ - тип доступа, объявляется с помощью модификатора доступа public
    или вообще не указывается
    Если модификатор доступа отсуствует, то применяется правило - интерфейс
    считает доступным только членам своего пакета.

    При объявлении метода указываются их сигнатуры(имя переменной+параметр'ы) +
    + возвращаемый тип данных.
    Методы по сути абстрактные. Реализация метода не может содержаться в составе интерфейса

    Переменные, которые объявлены в интерфейсе, не являются переменными экземпляра.
    Обязательно подлежат иницииализации. По сути являются константами

Переменные в интерфейсах 337 страница


















     */
}
