package HomeWork.CH8;

public class HWch8 {
    /*
    2. Пространство имен - использование пакетов и имен в них.
    Нельзя держать в одном пакете 2 класса\интерфейса с одинаковым именем,
    такие файлы должны быть в разных пакетах.

     3.В папках(?) В Java пакет хранится в отдельной папке с тем же именем,
     что и название пакета.

     4.протектед дает доступ в пакете + в наследниках, даже, если они в других пакетах

     5. импорт или указать их фулл имя

     6.Полиморфизм

     7.Любое кол-во, т.к. это один из принципов полиморфизма. Сколько по кайфу жи ес!
     8. Да
     10. Константы
     11. Да
     12. java.io.lang +- так без Io

     13. дефолт*
     14. да
     15. default
     16. он относится к классу, с помощью super
     17. да



     */
}
