package Chapter5;

public class AboutArray {
    // тип имя_массива [] = new тип{размер};
    /*
    Тип - конкретный тип масива, аля int,double,String и т.д.
    Он определяет тип данных каждого элемента

   Размер - число элементов массива.
   Массив создает в два этапа, сначала объявляется переменная, которая
   ссылается на массив, а затем выделяется память под массив.
  Далее ссылка на эту ячейку памяти присваивается переменной массива.



Стек - набор элементов с доступым - "Первым пришел - последним вышел".
Очередь - первым пришел - первым ушел. Есть две операции - размещение и извлечение.
При размещении элементы в очереди он переходит в конец очереди, то есть обслуживается последним.
При извлечении элемент выходит внеочереди
Элемент, который был когда то извлечен из очереди, не может быть извлечен из нее повторно
     */
}
