package HomeWork;

public class Chapter3_task4 {
    public static void main(String[] args) {
        /*
        Напишите цикл fo r, в котором перебирались бы значения от 1000 до 0 с
         шагом 2
         */
        for (int x = 1000; x>=0; x-=2) {
            System.out.println(x);

        }
    }
}
